echo "iotop это консольная утилита для мониторинга в реальном времени процессов, создающих нагрузку на дисковую подсистему"
echo "дополнительно использую ключ -о для монторинга только активных процессов"
echo "для испольнения требуются root права, так как команда читает данные из ядрa"
echo "sudo iotop -o"
sudo iotop -o
echo "можно испльзовать atop. не требует рут, обновление раз в 10 секунд, видит всю систему целиком. можно посмотреть нагрузку для всех процессов, включая завершившиеся за интервал."
atop
